
remove_sdc 
create_Clock –period 3.5 [get_ports clk]
set_Clock_latency -source –max 0.5 [get_Clocks clk]
set_Clock_latency –max 0.5 [get_Clocks clk]
set_Clock_uncertainty 0.175 [get_Clocks clk]
set_Clock_transition -max 0.1 [get_Clocks clk]
set_input_delay –max 2.1 [remove_from_collection [all_inputs] [get_ports "clk"]] 
set_output_delay –max 2.1 [all_outputs]
set_driving_cell -max -lib_cell NbufferFX2_LVT [all_inputs]
set_load -max 10 [all_outputs]
